

// Почувствуй себя интерном

//     Вывести квадрат числа

//     По двум заданным числам проверять является ли первое квадратом второго

//     Даны два числа. Показать большее и меньшее число

//     По заданному номеру дня недели вывести его название

//     Найти максимальное из трех чисел

//     Написать программу вычисления значения функции y=f(a)

//     Выяснить является ли число чётным

//     Показать числа от -N до N

//     Показать четные числа от 1 до N

//     Показать последнюю цифру трёхзначного числа

//     Показать вторую цифру трёхзначного числа

//     Дано число из отрезка [10, 99]. Показать наибольшую цифру числа

//     Удалить вторую цифру трёхзначного числа

//     Выяснить, кратно ли число заданному, если нет, вывести остаток.

//     Найти третью цифру числа или сообщить, что её нет

// Почувствуй себя джуном

//     Дано число. Проверить кратно ли оно 7 и 23

//     Дано число обозначающее день недели. Выяснить является номер недели выходным днём

//     По двум заданным числам проверять является ли одно квадратом другого

//     Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y

//     Определить номер четверти плоскости, в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0

//     Ввести номер четверти, показать диапазоны для возможных координат

//     Программа проверяет пятизначное число на палиндромом.

//     Найти расстояние между точками в пространстве 2D/3D

// Почувствуй себя мидлом 23. Показать таблицу квадратов чисел от 1 до N

//     Найти кубы чисел от 1 до N

//     Найти сумму чисел от 1 до А

//     Возведите число А в натуральную степень B используя цикл

//     Определить количество цифр в числе

//     Подсчитать сумму цифр в числе

//     Написать программу вычисления произведения чисел от 1 до N

//     Показать кубы чисел, заканчивающихся на четную цифру

// Почувствуй себя сеньором

//     Задать массив из 8 элементов и вывести их на экран

//     Задать массив из 8 элементов, заполненных нулями и единицами вывести их на экран

//     Задать массив из 12 элементов, заполненных числами из [0,9]. Найти сумму положительных/отрицательных элементов массива

//     Написать программу замену элементов массива на противоположные

//     Определить, присутствует ли в заданном массиве, некоторое число

//     Задать массив, заполнить случайными положительными трёхзначными числами. Показать количество нечетных\четных чисел

//     В одномерном массиве из 123 чисел найти количество элементов из отрезка [10,99]

//     Найти сумму чисел одномерного массива стоящих на нечетной позиции

//     Найти произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

//     В Указанном массиве вещественных чисел найдите разницу между максимальным и минимальным элементом

// Почувствуй себя лидом

//     Выяснить являются ли три числа сторонами треугольника

//     Определить сколько чисел больше 0 введено с клавиатуры

//     Написать программу преобразования десятичного числа в двоичное

//     Найти точку пересечения двух прямых заданных уравнением y=kx+b, а1 k1 и а2 и k2 заданы

//     Показать числа Фибоначчи

//     Написать программу масштабирования фигуры

//     Написать программу копирования массива

