// 5. Написать программу вычисления значения функции y=f(a)
// double Sinus()
// {
//     Console.WriteLine("Введите значение а");
//     string A = Console.ReadLine();
//     double a = double.Parse(A);
//     return Math.Sin(a);
// }

// Console.WriteLine(Sinus()); 

