// 43. Написать программу преобразования десятичного числа в двоичное
// string ConvToBin(int arg)
// {
//     string str = string.Empty;
//     while (arg > 0)
//     {
//         str = str.Insert(0, Convert.ToString(arg % 2));
//         arg /= 2;
//     }
//     return str;
// }
// Console.WriteLine(ConvToBin(52));
