// 11. Дано число из отрезка [10, 99]. Показать наибольшую цифру числа

// bool Test11(int arg1, int arg2)
// {
//     return arg1 > arg2;
// }

// int num = new Random().Next(9, 100);
// Console.Clear();
// Console.WriteLine($"Случайное число из диапазона [10, 99]: {num}");
// int arg1 = num % 10;
// int arg2 = num / 10;

// if (Test11(arg1, arg2)) Console.WriteLine($"Наибольшее: {arg1}");
// else Console.WriteLine($"Наибольшее: {arg2}");
