// 29. Написать программу вычисления произведения чисел от 1 до N

// int WorkNum(int arg)
// {
//     int work = 1;
//     for (int i = 1; i <= arg; i++) work *= i;
//     return work;
// }

// int n = 5;
// Console.WriteLine(WorkNum(n));